# General information

<i>'No BS, just essential pandas!'</i> 

Cheat sheet to data wrangling with Python pandas. The aim is to cover essential tips and tricks for data work flow. Each topic is featured with a minimal working example. The cheat sheet is work in progress, meaning that all suggestions for improvements are welcome!

Note: Section numbering and links visible in the table of contents unfortunately do not work in the code cells due to restrictions in Github Jupyter notebook support. Use browser search field instead to locate desired headline.

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc" style="margin-top: 1em;"><ul class="toc-item"><li><span><a href="#General-information" data-toc-modified-id="General-information-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>General information</a></span></li><li><span><a href="#Input/output-data" data-toc-modified-id="Input/output-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Input/output data</a></span><ul class="toc-item"><li><span><a href="#Excel-files" data-toc-modified-id="Excel-files-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Excel files</a></span><ul class="toc-item"><li><span><a href="#Import-Excel-file" data-toc-modified-id="Import-Excel-file-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Import Excel file</a></span></li><li><span><a href="#Export-Excel-file" data-toc-modified-id="Export-Excel-file-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Export Excel file</a></span><ul class="toc-item"><li><span><a href="#Quick-and-dirty" data-toc-modified-id="Quick-and-dirty-2.1.2.1"><span class="toc-item-num">2.1.2.1&nbsp;&nbsp;</span>Quick and dirty</a></span></li><li><span><a href="#More-complete" data-toc-modified-id="More-complete-2.1.2.2"><span class="toc-item-num">2.1.2.2&nbsp;&nbsp;</span>More complete</a></span></li></ul></li></ul></li><li><span><a href="#SQL" data-toc-modified-id="SQL-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>SQL</a></span><ul class="toc-item"><li><span><a href="#Import-SQL-table" data-toc-modified-id="Import-SQL-table-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>Import SQL table</a></span></li></ul></li></ul></li><li><span><a href="#Basic-DataFrame-operations" data-toc-modified-id="Basic-DataFrame-operations-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Basic DataFrame operations</a></span><ul class="toc-item"><li><span><a href="#DataFrame-initialization" data-toc-modified-id="DataFrame-initialization-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>DataFrame initialization</a></span></li><li><span><a href="#Modifying-DataFrame" data-toc-modified-id="Modifying-DataFrame-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Modifying DataFrame</a></span><ul class="toc-item"><li><span><a href="#Renaming-columns" data-toc-modified-id="Renaming-columns-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Renaming columns</a></span></li><li><span><a href="#Sort-DataFrame-in-custom-column-order" data-toc-modified-id="Sort-DataFrame-in-custom-column-order-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>Sort DataFrame in custom column order</a></span></li><li><span><a href="#Sort-DataFrame-in-custom-row-order" data-toc-modified-id="Sort-DataFrame-in-custom-row-order-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>Sort DataFrame in custom row order</a></span></li><li><span><a href="#Changing-data-types" data-toc-modified-id="Changing-data-types-3.2.4"><span class="toc-item-num">3.2.4&nbsp;&nbsp;</span>Changing data types</a></span></li><li><span><a href="#Add-row-to-DataFrame" data-toc-modified-id="Add-row-to-DataFrame-3.2.5"><span class="toc-item-num">3.2.5&nbsp;&nbsp;</span>Add row to DataFrame</a></span></li><li><span><a href="#Add-column-to-DataFrame" data-toc-modified-id="Add-column-to-DataFrame-3.2.6"><span class="toc-item-num">3.2.6&nbsp;&nbsp;</span>Add column to DataFrame</a></span></li><li><span><a href="#Dropping-from-DataFrame" data-toc-modified-id="Dropping-from-DataFrame-3.2.7"><span class="toc-item-num">3.2.7&nbsp;&nbsp;</span>Dropping from DataFrame</a></span></li><li><span><a href="#Altering-DataFrame-values-by-broadcasting" data-toc-modified-id="Altering-DataFrame-values-by-broadcasting-3.2.8"><span class="toc-item-num">3.2.8&nbsp;&nbsp;</span>Altering DataFrame values by broadcasting</a></span></li><li><span><a href="#Concatenate-two-columns-into-one" data-toc-modified-id="Concatenate-two-columns-into-one-3.2.9"><span class="toc-item-num">3.2.9&nbsp;&nbsp;</span>Concatenate two columns into one</a></span></li></ul></li><li><span><a href="#Slicing-data-frame" data-toc-modified-id="Slicing-data-frame-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Slicing data frame</a></span><ul class="toc-item"><li><span><a href="#Basic-sclicing" data-toc-modified-id="Basic-sclicing-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span>Basic sclicing</a></span></li><li><span><a href="#Conditional-slicing/indexing-(boolean-masking)" data-toc-modified-id="Conditional-slicing/indexing-(boolean-masking)-3.3.2"><span class="toc-item-num">3.3.2&nbsp;&nbsp;</span>Conditional slicing/indexing (boolean masking)</a></span></li><li><span><a href="#Slicing-based-on-partial-string-match-in-column" data-toc-modified-id="Slicing-based-on-partial-string-match-in-column-3.3.3"><span class="toc-item-num">3.3.3&nbsp;&nbsp;</span>Slicing based on partial string match in column</a></span></li></ul></li><li><span><a href="#Iterating-over-DataFrame" data-toc-modified-id="Iterating-over-DataFrame-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Iterating over DataFrame</a></span></li><li><span><a href="#About-chain-indexing" data-toc-modified-id="About-chain-indexing-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>About chain indexing</a></span></li><li><span><a href="#Method-chaining" data-toc-modified-id="Method-chaining-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>Method chaining</a></span></li><li><span><a href="#Data-types-and-scales" data-toc-modified-id="Data-types-and-scales-3.7"><span class="toc-item-num">3.7&nbsp;&nbsp;</span>Data types and scales</a></span></li></ul></li><li><span><a href="#Hierarchical-indexing-(MultiIndex)" data-toc-modified-id="Hierarchical-indexing-(MultiIndex)-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Hierarchical indexing (MultiIndex)</a></span><ul class="toc-item"><li><span><a href="#Initialize-DataFrame-with-hierarchical-indexing" data-toc-modified-id="Initialize-DataFrame-with-hierarchical-indexing-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Initialize DataFrame with hierarchical indexing</a></span></li><li><span><a href="#Modifying-MultiIndex-DataFrame" data-toc-modified-id="Modifying-MultiIndex-DataFrame-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Modifying MultiIndex DataFrame</a></span><ul class="toc-item"><li><span><a href="#Add-second-index-to-existing-DataFrame" data-toc-modified-id="Add-second-index-to-existing-DataFrame-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span>Add second index to existing DataFrame</a></span></li><li><span><a href="#Add-new-column-to-existing-MultiIndex-DataFrame" data-toc-modified-id="Add-new-column-to-existing-MultiIndex-DataFrame-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span>Add new column to existing MultiIndex DataFrame</a></span></li><li><span><a href="#Get-different-MultiIndex-levels" data-toc-modified-id="Get-different-MultiIndex-levels-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span>Get different MultiIndex levels</a></span></li></ul></li><li><span><a href="#Quering-MultiIndex-DataFrames" data-toc-modified-id="Quering-MultiIndex-DataFrames-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Quering MultiIndex DataFrames</a></span></li></ul></li><li><span><a href="#Data-wrangling-tricks" data-toc-modified-id="Data-wrangling-tricks-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Data wrangling tricks</a></span><ul class="toc-item"><li><span><a href="#Mappings-for-column-values" data-toc-modified-id="Mappings-for-column-values-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Mappings for column values</a></span><ul class="toc-item"><li><span><a href="#One-to-one-mappings" data-toc-modified-id="One-to-one-mappings-5.1.1"><span class="toc-item-num">5.1.1&nbsp;&nbsp;</span>One-to-one mappings</a></span><ul class="toc-item"><li><span><a href="#Map-from-dict" data-toc-modified-id="Map-from-dict-5.1.1.1"><span class="toc-item-num">5.1.1.1&nbsp;&nbsp;</span>Map from dict</a></span></li><li><span><a href="#Assign-unique-identifier-to-column-values" data-toc-modified-id="Assign-unique-identifier-to-column-values-5.1.1.2"><span class="toc-item-num">5.1.1.2&nbsp;&nbsp;</span>Assign unique identifier to column values</a></span></li><li><span><a href="#Map-column-string-values-to-lowercase" data-toc-modified-id="Map-column-string-values-to-lowercase-5.1.1.3"><span class="toc-item-num">5.1.1.3&nbsp;&nbsp;</span>Map column string values to lowercase</a></span></li><li><span><a href="#Using-regex-with-map" data-toc-modified-id="Using-regex-with-map-5.1.1.4"><span class="toc-item-num">5.1.1.4&nbsp;&nbsp;</span>Using regex with map</a></span></li></ul></li><li><span><a href="#Map-values-to-ranges/groups" data-toc-modified-id="Map-values-to-ranges/groups-5.1.2"><span class="toc-item-num">5.1.2&nbsp;&nbsp;</span>Map values to ranges/groups</a></span></li><li><span><a href="#Categorical-variable-to-dummy-columns" data-toc-modified-id="Categorical-variable-to-dummy-columns-5.1.3"><span class="toc-item-num">5.1.3&nbsp;&nbsp;</span>Categorical variable to dummy columns</a></span></li><li><span><a href="#Map-column-string-values-to-lowercase" data-toc-modified-id="Map-column-string-values-to-lowercase-5.1.4"><span class="toc-item-num">5.1.4&nbsp;&nbsp;</span>Map column string values to lowercase</a></span></li></ul></li><li><span><a href="#Change-between-long/wide-format" data-toc-modified-id="Change-between-long/wide-format-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Change between long/wide format</a></span><ul class="toc-item"><li><span><a href="#Wide-to-long" data-toc-modified-id="Wide-to-long-5.2.1"><span class="toc-item-num">5.2.1&nbsp;&nbsp;</span>Wide to long</a></span></li><li><span><a href="#Long-to-wide" data-toc-modified-id="Long-to-wide-5.2.2"><span class="toc-item-num">5.2.2&nbsp;&nbsp;</span>Long to wide</a></span></li></ul></li><li><span><a href="#Database-like-joins" data-toc-modified-id="Database-like-joins-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Database-like joins</a></span></li><li><span><a href="#Aggregating-infromation-in-DataFrame" data-toc-modified-id="Aggregating-infromation-in-DataFrame-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Aggregating infromation in DataFrame</a></span><ul class="toc-item"><li><span><a href="#Simple-means,-medians-etc." data-toc-modified-id="Simple-means,-medians-etc.-5.4.1"><span class="toc-item-num">5.4.1&nbsp;&nbsp;</span>Simple means, medians etc.</a></span></li><li><span><a href="#'Group-by'-in-various-forms" data-toc-modified-id="'Group-by'-in-various-forms-5.4.2"><span class="toc-item-num">5.4.2&nbsp;&nbsp;</span>'Group by' in various forms</a></span></li><li><span><a href="#Agg-method" data-toc-modified-id="Agg-method-5.4.3"><span class="toc-item-num">5.4.3&nbsp;&nbsp;</span>Agg method</a></span></li><li><span><a href="#Pivot-table" data-toc-modified-id="Pivot-table-5.4.4"><span class="toc-item-num">5.4.4&nbsp;&nbsp;</span>Pivot table</a></span></li></ul></li></ul></li><li><span><a href="#Data-cleaning" data-toc-modified-id="Data-cleaning-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data cleaning</a></span><ul class="toc-item"><li><span><a href="#Replace-all-non-numerical-values-with-NaN" data-toc-modified-id="Replace-all-non-numerical-values-with-NaN-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Replace all non-numerical values with NaN</a></span></li><li><span><a href="#Find-NaN-values-from-DataFrame" data-toc-modified-id="Find-NaN-values-from-DataFrame-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Find NaN values from DataFrame</a></span></li><li><span><a href="#Clean-NaN-values" data-toc-modified-id="Clean-NaN-values-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Clean NaN values</a></span></li><li><span><a href="#Drop-rows/columns-with-NaN-values" data-toc-modified-id="Drop-rows/columns-with-NaN-values-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Drop rows/columns with NaN values</a></span></li></ul></li><li><span><a href="#Working-with-time-and-dates" data-toc-modified-id="Working-with-time-and-dates-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Working with time and dates</a></span><ul class="toc-item"><li><span><a href="#Time-and-date-data-types" data-toc-modified-id="Time-and-date-data-types-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Time and date data types</a></span></li><li><span><a href="#Time-series-tricks" data-toc-modified-id="Time-series-tricks-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Time series tricks</a></span><ul class="toc-item"><li><span><a href="#Basic-operations" data-toc-modified-id="Basic-operations-7.2.1"><span class="toc-item-num">7.2.1&nbsp;&nbsp;</span>Basic operations</a></span></li><li><span><a href="#Get-mean-value-per-day-over-multiple-years" data-toc-modified-id="Get-mean-value-per-day-over-multiple-years-7.2.2"><span class="toc-item-num">7.2.2&nbsp;&nbsp;</span>Get mean value per day over multiple years</a></span></li></ul></li></ul></li></ul></div>

In [13]:
############################################################
# Run this cell!
# Dependencies, auxiliary functions etc.
############################################################
import pandas as pd
import numpy as np
import datetime
from IPython.display import display_html
from IPython.display import display
import datetime
import random

def display_side_by_side(*args):
    html_str=''
    for df in args:
        html_str+=df.to_html()
    html_str = html_str.replace('table','table style="display:inline; border:0px"')          
    display_html(html_str,raw=True)

# Input/output data

## Excel files

### Import Excel file

In [2]:
# Example applies to Windows paths
import os
path = r'C:\myfolder'
file = 'myfile.xlsx'
df = pd.read_excel(os.path.join(path,file)
                   ,sheetname = 'Sheet1'
                   ,skiprows = 16
                   ,parse_cols = ("A,C:F")
                   ,header = None
                   ,index_col = 0)

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\myfolder\\myfile.xlsx'

### Export Excel file

#### Quick and dirty

In [ ]:
# Example applies to Windows paths
import os
path = r'C:\myfolder'
file = 'myfile.xlsx'
writer = pd.ExcelWriter(os.path.join(path,file))
df.to_excel(writer, 'Sheet1', header = True)
writer.save()

#### More complete

In [ ]:
# Styling:
# http://pbpython.com/improve-pandas-excel-output.html
from openpyxl import load_workbook
book = load_workbook(os.path.join(path,file))
writer = pd.ExcelWriter('results.xlsx', engine = 'openpyxl')
writer.book = book

#writer.sheets = dict((ws.title, ws) for ws in book.worksheets) # get sheet names for writer

book.remove_sheet(book.get_sheet_by_name('Sheet1'))

df.to_excel(writer, "Sheet1", header = True, startrow = 1, startcol = 1)
df.to_excel(writer, "Sheet1", header = True, startrow = 1, startcol = 19)
writer.save()

## SQL

### Import SQL table

In [ ]:
cnxn = pyodbc.connect("Driver = {SQL Server};"
                      "Server = {server_name};"
                      "Database = dbo_name;"
                      "Trusted_Connection = yes;")
cursor = cnxn.cursor()
sql = "SELECT *" \
      "FROM dbo.table"
df = psql.read_sql_query(sql, cnxn)
cnxn.close()

# Basic DataFrame operations

## DataFrame initialization

In [3]:
# Initialize DataFrame with dummy data and custom indices
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uu'])
display(df)

         ff        ee        tt        uu
0  0.619562  0.348882  0.824261  0.974331
1  0.335243  0.064855  0.540112  0.027981
2  0.213909  0.927155  0.484550  0.629162
3  0.651557  0.133179  0.598534  0.453358

In [4]:
# Initialize DataFrame with custom data
data = {'ID': [1, 2, 3], 'Names': ['Kate', 'John', 'Max'], 'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data, columns = ['ID', 'Names', 'Age', 'Values', 'Country'])

# Set one of the columns as index
df2 = df.set_index('ID')
 # Remove index name
df2.index.name = None

# Re-setting index
df3 = df2.copy()
df3.reset_index(inplace = True, drop = True) # drop = True; denies addition of old index to columns

display_side_by_side(df,df2,df3)

## Modifying DataFrame

### Renaming columns

In [5]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data)
df2 = df.copy()
df.rename(columns = {"Names": "Name", "Age": "Alter"}, inplace = True)
display_side_by_side(df2,df)

,Age,ID,Names,Values
0,50,1,Kate,3
1,25,2,John,4
2,41,3,Max,8
,Alter,ID,Name,Values
0,50,1,Kate,3
1,25,2,John,4
2,41,3,Max,8

### Sort data frame by colum values

In [6]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 25], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data)

df2 = df.sort_values(['Age','Names'], ascending  = [True, False]).copy()

display_side_by_side(df,df2)

,Age,ID,Names,Values
0,50,1,Kate,3
1,25,2,John,4
2,25,3,Max,8
,Age,ID,Names,Values
2,25,3,Max,8
1,25,2,John,4
0,50,1,Kate,3

### Sort data frame by colums, custom order

In [7]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data)
df2 = df.copy()
df2.index = pd.Categorical(df2.index, [2,0,1])
df2 = df2.sort_index(axis = 0)
display_side_by_side(df, df2)

,Age,ID,Names,Values
0,50,1,Kate,3
1,25,2,John,4
2,41,3,Max,8
,Age,ID,Names,Values
2,41,3,Max,8
0,50,1,Kate,3
1,25,2,John,4

### Change DataFrame column order

In [8]:
data = {'ID': [1, 2,], 'Names': ['John', 'Max'], 'Vals1': [50, 41], 'Vals2': [4.0, 8.0], 'Vals3': ['4.4', '3.1']}
df = pd.DataFrame(data = data)
df2 = df.iloc[:, ::-1].copy()
df3 = df[['Vals2', 'Names', 'Vals3', 'Vals1']].copy()
display_side_by_side(df,df2,df3)

### Changing data types

In [9]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max']
        ,'Vals1': [50, 25, 41], 'Vals2': [3.0, 4.0, 8.0], 'Vals3': ['3.0', '4.4', '3.1']}
df = pd.DataFrame(data=data)
df2 = df.copy()

# Here we convert to numpy data types instead of native python types (float/int)
# Numpy data types are of fixed size but are more efficient
df2['Vals1'] = df2['Vals1'].astype('float64')
df2['Vals2'] = df2['Vals2'].astype('int64')
df2['Vals3'] = df2['Vals3'].astype('float64') # string to float, see also pd.to_numeric

display_side_by_side(df,df2)

,ID,Names,Vals1,Vals2,Vals3
0,1,Kate,50,3.0,3.0
1,2,John,25,4.0,4.4
2,3,Max,41,8.0,3.1
,ID,Names,Vals1,Vals2,Vals3
0,1,Kate,50.0,3,3.0
1,2,John,25.0,4,4.4
2,3,Max,41.0,8,3.1

### Add row to DataFrame

In [10]:
data = {'ID': [1, 2,], 'Names': ['John', 'Max'],'Vals1': [50, 41], 'Vals2': [4.0, 8.0], 'Vals3': ['4.4', '3.1']}
df = pd.DataFrame(data = data)

df2 = pd.DataFrame({'ID': [4], 'Names': ['Janet'], 'Vals1': [50], 'Vals2': [12.0], 'Vals3': ['2.9']})
df3 = df.append(df2, ignore_index = True)

display_side_by_side(df,df3)

,ID,Names,Vals1,Vals2,Vals3
0,1,John,50,4.0,4.4
1,2,Max,41,8.0,3.1
,ID,Names,Vals1,Vals2,Vals3
0,1,John,50,4.0,4.4
1,2,Max,41,8.0,3.1
2,4,Janet,50,12.0,2.9

### Add column to DataFrame

In [11]:
df = pd.DataFrame(data = {'ID': [1, 2, 3], 'Names': ['John', 'Max', 'Jane'],'Vals1': [50, 41, 32]})
df2 = pd.DataFrame(data = {'Vals2': [0.8, 0.6, 0.4]})
df3 = pd.concat([df, df2], axis = 1)
display_side_by_side(df, df2, df3)

### Dropping from DataFrame

In [12]:
data = {'ID': [1, 2, 3, 4, 5, 6]
        ,'Names': ['Kate', 'John', 'Max', 'Mary', 'Pete', 'Miriam']
        ,'Age': [50, 25, 41, 99, 54, 23]
        ,'Values': [3, 4, 8, 4, 3, 4]
        ,'col': [None]}
df_orig = pd.DataFrame(data=data, index = ['a','b','c','d', 'e', 'f'])
df = df_orig.copy()

# Drop columns by column label
df.drop(['Age', 'Names'], axis = 1, inplace = True)

# Drop column by fancy indexing
df.drop(df.columns[0], axis = 1, inplace = True)

# Drop column by ugin del; is directly inplace!
del df['col']

# Drop rows by index label
df.drop(['b'], axis = 0 , inplace = True)

# Drop rows by index number
df.drop(df.index[[0]], axis = 0, inplace = True)

# Drop rows where value in column does not fulfill condition
df = df[df['Values'] <= 5]

# Drop first n = 1 rows
df.drop(df.head(1).index,inplace=True)

# Drop last n = 1 rows
df.drop(df.tail(1).index,inplace=True) # drop last n rows

display_side_by_side(df_orig,df)

In [13]:
# Drop columns except those we want to keep
data = {'ID': [1, 2, 3, 4], 'Names': ['Kate', 'John', 'Max', 'Mary'], 'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4], 'col': [None]}
df = pd.DataFrame(data = data, index = ['a','b','c','d'])
columns_to_keep = ['Names', 'Values']
df2 = df[columns_to_keep].copy()
display_side_by_side(df, df2)

### Altering DataFrame values

In [14]:
df = pd.DataFrame(np.arange(12).reshape(6,2), columns = ['ff', 'er'])
df2 = df.copy()

# Apply change to whole column
df2['ff'] *= 0.8

# Conditionally modify certain cells
df2.loc[df2['er'] < 7,'er'] -= 2

display_side_by_side(df,df2)

,ff,er
0,0,1
1,2,3
2,4,5
3,6,7
4,8,9
5,10,11
,ff,er
0,0.0,-1
1,1.6,1
2,3.2,3
3,4.8,7
4,6.4,9
5,8.0,11

### Concatenate two columns into one

In [15]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'], 'Occupation': ['CEO', 'Doctor', 'Driver']
        ,'Vals1': [50, 25, 41], 'Vals2': [3.0, 4.0, 8.0]}
df = pd.DataFrame(data=data)
df2 = df.copy()

df2['two_string_cols'] = df2['Names'] + '_' + df2['Occupation']
df2['str_and_numeric'] = df2['Names'] + '_' + df2['Vals2'].map(str)
df2['format_numerics'] = df2['Names'] + '_' + df2['Vals2'].map("{:.0f}".format)

display_side_by_side(df, df2)

### Calculating new column conditionally

In [16]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'val1': [50, 25, 41], 'val2': [3.0, 0, 8.0]}
df = pd.DataFrame(data=data)
df2 = df.copy()
df3 = df.copy()

df2['val1/val2']  = df2['val1']/df2['val2']
df3['val1/val2']  = np.where(df2['val2'] != 0, df2['val1']/df2['val2'], np.nan)
df2['val1']/df2['val2']

display_side_by_side(df, df2, df3)

## Slicing data frame

### Basic sclicing

In [17]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])

# Selecting columns
# Using single square brackets selects a Series from DataFrame. 
# Using multiple square brackets selects a slice of data frame (possibly with muliple columns) 
df['ff'] # returns Series
df[['ff']] # returns DataFrame with one column
df[['ff', 'ee']] # returns DataFrame with two columns
df.loc[:,['ee', 'tt']]
df.iloc[:,0] # by position in frame
df.iloc[:,0:3] # first 3 columns

# Selecting rows
df.loc['first'] # by index
df.loc[~df.index.isin(['first'])] # rows except index 'first'
df.loc[['first', 'fourth']] # by index multiple rows
df[0:3]
df.iloc[0:2] # by position in frame

# Using data[2] or data['label'] indexes the series itself, skipping the iloc/loc
# attributes. This is syntatic sugar, but it is safer to use iloc/loc attributes
# explicitly in order avoid confusion querying between index label and index position.

display_side_by_side(df, df.loc[:,['ee','tt']], df.iloc[0:2], df.loc[~df.index.isin(['first'])], df.iloc[:,0:3]
)

### Conditional slicing/indexing (boolean masking)

In [18]:
data = {'ID': [1, 2, 3, 4], 'Names': ['Kate', 'John', 'Max', 'Mary'], 'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4]}
df = pd.DataFrame(data=data, index = ['a','b','c','d'])

# Get row slice fulfilling a condition along one column, return only
# certain columns
df2 = pd.DataFrame(df.loc[df['Values'] < 5,  ['Names', 'Values']].copy())

# Same as above but multiple conditions, return all columns tha match
df3 = df.loc[(df['Values'] < 5 ) & (df['Names'] == 'John'), ].copy()

# Conditional indexing by preserving original dimensions
df4 = df.where(df['Values'] < 5).copy()

display_side_by_side(df,df2,df3,df4)

### Slicing based on partial string match in column

In [19]:
data = {'ID': [1, 2, 3, 4], 'Names': ['Kare', 'John', 'Max', 'Mary'], 'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4]}
df = pd.DataFrame(data=data, index = ['a','b','c','d'])
df2 = df.copy()

df2 = df2[df2['Names'].str.contains("ar")]

display_side_by_side(df, df2)

,Age,ID,Names,Values
a,50,1,Kare,3
b,25,2,John,4
c,41,3,Max,8
d,99,4,Mary,4
,Age,ID,Names,Values
a,50,1,Kare,3
d,99,4,Mary,4

## Iterating over DataFrame

In [20]:
data = {'Names': ['Kate', 'John', 'Max'], 'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data = data)

# "Right" way with df.iterrows 
for index, row in df.iterrows():
    print(index, row['Age'])

print('-'*30)    

# "Normal" integer looping over rows
for counter in range(0,len(df)):
    print(df.iloc[counter,0])

0 50
1 25
2 41
------------------------------
50
25
41

In [21]:
# Set values during row iteration
data = {'Names': ['Kate', 'John', 'Max'], 'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data = data)
df2 = df.copy()

for index, row in df2.iterrows():
    if row['Names'] == 'John':
        df2.set_value(index, 'Weight', 100)
display_side_by_side(df,df2)

,Age,Names,Weight
0,50,Kate,62
1,25,John,76
2,41,Max,98
,Age,Names,Weight
0,50,Kate,62
1,25,John,100
2,41,Max,98

## About chain indexing

In [22]:
# A rule of thub is that any time you see back-to-back square brackets,
# ][, you're asking for trouble. Replace that with a .loc[] or .iloc[]
# and you'll be set. Let's see an example

df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
display(df)
print(df['ee']['second']) # bad practice
print(df.loc['second', 'ee']) # good practice

              ff        ee        tt       uuu
first   0.040172  0.918014  0.284994  0.247170
second  0.790604  0.712705  0.744147  0.604816
third   0.234373  0.951541  0.070026  0.682034
fourth  0.964662  0.735669  0.969218  0.734263

0.71270500583
0.71270500583

In [23]:
# Another example
df = pd.DataFrame()
df['x'] = np.arange(10,14)
df['value'] = np.arange(200,204)
display(df)

print(df[ df['x']== 10 ]['value']) # bad practice
print('-'*30)
print(df.loc[df['x'] == 10, 'value']) # good practice

# The bad practice option would't even work in the case
# we want to assign a new value for the returned obseravtions

#df[ df['x']== 10 ]['value'] = 1000 # this throws error!
print('-'*30)
df.loc[df['x'] == 10, 'value'] = 1000
display(df)

    x  value
0  10    200
1  11    201
2  12    202
3  13    203

0    200
Name: value, dtype: int32
------------------------------
0    200
Name: value, dtype: int32
------------------------------

    x  value
0  10   1000
1  11    201
2  12    202
3  13    203

## Method chaining

In [24]:
# 'Pandorable' way is to chain methods operating on DataFrame:
data = {'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data=data)

df2 = df.copy()
# Not-so-good practice: two lines of code
df2 = df2.drop(df2[df2['Age'] == 25].index)
df2.rename(columns={'Weight': 'Weight (kg)'}, inplace = True)

df3 = df.copy()
# Better practice - on line of code
df3 = df3.drop(df3[df3['Age'] == 25].index).rename(columns = {'Weight': 'Weight (kg)'}).copy()

display_side_by_side(df,df2,df3)

,Age,Names,Weight
0,50,Kate,62
1,25,John,76
2,41,Max,98
,Age,Names,Weight (kg)
0,50,Kate,62
2,41,Max,98
,Age,Names,Weight (kg)
0,50,Kate,62
2,41,Max,98

## Data types and scales

This section is till incomplete!

In general, there are 4 types of data scales
<ol>
  <li>Ratio scale, e.g. height</li>
  <li>Inteval scale, e.g. temperature</li>
  <li>Ordinal scale, e.g. grading scale</li>
  <li>Nominal scale, e.g. school names</li>
</ol>

In [25]:
# Specify a column in DataFrame to be gatecorigal, sort by categorical order
df = pd.DataFrame(['E','M','L','M','I','A','B','B','M'], columns = ['Grades'])

# Categories need to be passed in ascending order!
df['Grades'] = df['Grades'].astype('category', categories = ['I','A','B','C','M','E','L'], ordered = True)
df2 = df.sort_values(['Grades'], ascending  = False).copy()
df3 = df[df['Grades'] >= 'M'].copy()

display_side_by_side(df,df2,df3)

,Grades
0,E
1,M
2,L
3,M
4,I
5,A
6,B
7,B
8,M
,Grades
2,L
0,E
8,M
3,M
1,M
7,B
6,B
5,A
4,I
,Grades
0,E
1,M
2,L
3,M
8,M

# Hierarchical indexing (MultiIndex)

## Initialize DataFrame with hierarchical indexing

In [26]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])
display_side_by_side(df)

## Modifying MultiIndex DataFrame

### Add second index to existing DataFrame

In [27]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3)), columns = ['col1','col1','col2'])
df2 = df.copy()
df2.set_index([df2.index, 'col2'], inplace = True)
df2.index.names = ['Index1', 'Index2']
display_side_by_side(df,df2)

,col1,col1,col2
0,0,1,2
1,3,4,5
2,6,7,8
3,9,10,11
,,col1,col1
Index1,Index2,,
0,2,0,1
1,5,3,4
2,8,6,7
3,11,9,10

### Add new column to existing MultiIndex DataFrame

In [28]:
df = pd.DataFrame(data = np.arange(16).reshape((4,4))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2','col2'], ['ff','gg','ff','gg']])

# Add new column to MultiIndex frame
df2 = df.copy()
df2['col2', 'dd'] = [0, 1, 2, 4]
display_side_by_side(df,df2)

### Get different MultiIndex levels

In [29]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])

print(df.columns.get_level_values(0))
print(df.columns.get_level_values(1))
print(df.index.get_level_values(0))
print(df.index.get_level_values(1))

Index(['col1', 'col1', 'col2'], dtype='object')
Index(['ff', 'gg', 'ff'], dtype='object')
Index(['a', 'a', 'b', 'b'], dtype='object')
Int64Index([1, 2, 1, 2], dtype='int64')

## Quering MultiIndex DataFrames

In [30]:
df = pd.DataFrame(data = np.arange(16).reshape((4,4))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2','col2'], ['ff','gg','ff','gg']])

# Get observations from certain column level
df2 = df.iloc[:, df.columns.get_level_values(1) == 'gg'].copy()
df2b = df.iloc[:, df.columns.get_level_values(1).isin(['gg','ee'])].copy()

# Get observations from certain index level
df3 = df.iloc[df.index.get_level_values(1) == 2,:].copy()

# Get observations from certain column levels (multi-condition)
df4 = df.iloc[:, (df.columns.get_level_values(0) == 'col1') & (df.columns.get_level_values(1) == 'gg')].copy()

display_side_by_side(df,df2,df2b,df3,df4)

# Data wrangling tricks

## Mappings for column values

### One-to-one mappings

#### Map from dict

In [31]:
data = {'ID': [1, 2, 3,4],'Names': ['Kate', 'John', 'Max','Kate'],'Age': [50, 25, 41,89], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data = data)
df2 = df.copy()

# Mapping from user defined dict
age_mapping = {25:0, 41:1, 50:2, 89:3}
df2['AgeOrder'] = df2['Age'].map(age_mapping)
display_side_by_side(df,df2)

#### Assign unique identifier to column values

In [32]:
data = {'ID': [1, 2, 3,4], 'Names': ['Kate', 'John', 'Max','Kate'], 'Age': [50, 25, 41,89], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data = data)
df2 = df.copy()

# Assign unique identifier to values in column (Names -> NameID)
d = {key: value for (key, value) in zip(df['Names'].unique(),range(len(df['Names'].unique())))}
df2['NameID'] = df2['Names'].map(d)
display_side_by_side(df,df2)

#### Map column string values to lowercase

In [33]:
data = {'ID': [1, 2, 3,4], 'Names': ['Kate', 'JoHn', 'MA4','KATE'], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data = data)
df2 = df.copy()
df2['Names'] = df2['Names'].map(lambda x: x if type(x)!=str else x.lower())

display_side_by_side(df, df2)

,ID,Names,Values
0,1,Kate,3
1,2,JoHn,4
2,3,MA4,8
3,4,KATE,12
,ID,Names,Values
0,1,kate,3
1,2,john,4
2,3,ma4,8
3,4,kate,12

#### Using regex with map

In [34]:
import re
data = {'ID': [1, 2, 3,4], 'Names': ['Kate', 'John', 'Max','Kate'], 'Values': ['foff', 'ss-d', '8', '-rrgr']}
df = pd.DataFrame(data = data)
df2 = df.copy()

# also includes the delimiter!
regex2 = re.compile("(?:-).*")
df2['Values'] = df2['Values'].replace(to_replace = regex2, value = 'REPLACED')

display_side_by_side(df, df2)

,ID,Names,Values
0,1,Kate,foff
1,2,John,ss-d
2,3,Max,8
3,4,Kate,-rrgr
,ID,Names,Values
0,1,Kate,foff
1,2,John,ssREPLACED
2,3,Max,8
3,4,Kate,REPLACED

### Map values to ranges/groups

In [35]:
data = {'ID': [1, 2, 3,4], 'Names': ['Kate', 'John', 'Max','Kate'], 'Age': [39, 18, 25,75], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data = data)
df2 = df.copy()

# Even-sized bins 
df2['ValGroup1'] = pd.cut(df2['Values'] , 4, right = True) # 4 bins, includes rightmost edge
                    
# Relative-sized bins 
df2['ValGroup2'] = pd.qcut(df2['Values'], 4)

# Custom bin sizes and labels
df2['AgeGroup'] = pd.cut(df2['Age'], [0, 20, 40, 60, 80, np.inf], labels = [1,2,3,4,5], right = True)

display_side_by_side(df,df2)

### Categorical variable to dummy columns

In [36]:
df = pd.DataFrame({'Category': ['Type1','Type2','Type1','Type3'], 'Value': np.random.rand(4)})

df2 = df.copy()
df2['Category'] = df2['Category'].astype('category', categories = ['Type1','Type2','Type3'], ordered = True)
df2 = pd.get_dummies(df2, prefix = ['Category'])

display_side_by_side(df,df2)

## Change between long/wide format

### Wide to long

In [37]:
# Create data
df = pd.DataFrame(data = np.arange(9).reshape((3,3)), columns = [['col1','col2','col3']])

df2 = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])

# Simple melt
df3 = pd.melt(df).copy()
df4 = pd.melt(df2).copy()

display_side_by_side(df,df3,df2,df4)

### Long to wide

In [38]:
# Create data
df = pd.DataFrame({
         'name1': ['A','A','B','B']
        ,'name2': ['A','B','A','B']
        ,'val': [5,9,7,3]})

df2 = df.pivot(index = 'name1', columns = 'name2', values = 'val').copy()

# If the above does not work, try pivot_table which is a generalization of
# pivot for duplicate entries.
df3 = df.pivot_table(values = 'val', index = 'name1', columns = 'name2').copy()

display_side_by_side(df,df2,df3)

In [39]:
# Pivot_table might not work with non-numeric columns
# In this case try the following (does however not work
# with duplicate indices

df = pd.DataFrame({'index' : range(8)
                  ,'variable1' : ["A","A","B","B","A","B","B","A"]
                  ,'variable2' : ["a","b","a","b","a","b","a","b"]
                  ,'result': ["on","off","off","on","on","off","off","on"]})

df1 = df.copy()
unstack_cols = ['variable1', 'variable2']
df1 = df.set_index(['index'] + unstack_cols).unstack(level = unstack_cols)

display_side_by_side(df,df1)

In [40]:
# Long to wide with time series type of data
data = { 'ID': [1, 1, 2, 2, 1, 1, 2, 2]
        ,'Date': ['2007-01-01','2007-01-01', '2007-01-01','2007-01-01', '2007-01-02','2007-01-02', '2007-01-02','2007-01-02']
        ,'Type': ['type1','type2','type1','type2','type1','type2','type1','type2']
        ,'Values': np.arange(8)}
df = pd.DataFrame(data = data)

df2 = df.groupby(['Date','ID','Type']).sum().unstack('ID').copy()
new_col_names = ['_'.join((str(b),a)) for a,b in df2.columns.get_values()] # flatten columns
df2.columns = new_col_names

df3 = df.groupby(['Date','ID','Type']).sum().unstack(['ID','Type']).copy()
new_col_names = ['_'.join((a,str(b),c)) for a,b,c in df3.columns.get_values()]
df3.columns = new_col_names

display_side_by_side(df,df2,df3)

## Database-like joins

In [41]:
# Create data
df = pd.DataFrame(data = np.arange(12).reshape((3,4)), columns = [['col1','col2','col3','col4']])
df2 = pd.DataFrame({'key': [0,1,2], 'vals': [4,6,8]})
display_side_by_side(df,df2)

In [42]:
# Different merges
df3 = pd.merge(df, df2,left_index = True, right_on = 'key',how = 'left')
df4 = pd.merge(df, df2,left_on = 'col2', right_on = 'key',how = 'left')
df5 = pd.merge(df, df2,left_on = 'col2', right_on = 'key',how = 'right')
df6 = pd.merge(df, df2,left_on = 'col2', right_on = 'key',how = 'inner')
df7 = pd.merge(df, df2,left_on = 'col2', right_on = 'key',how = 'outer')

# Right and left joins are basically the same, just different way around
# Compare df8 to df5
df8 = pd.merge(df2, df, left_on = 'key', right_on = 'col2', how = 'left')

display_side_by_side(df3,df4,df5,df6,df7,df8)

,col1,col2,col3,col4,key,vals
0,0,1,2,3,0,4
1,4,5,6,7,1,6
2,8,9,10,11,2,8
,col1,col2,col3,col4,key,vals
0,0,1,2,3,1.0,6.0
1,4,5,6,7,NaN,NaN
2,8,9,10,11,NaN,NaN
,col1,col2,col3,col4,key,vals
0,0.0,1.0,2.0,3.0,1,6
1,NaN,NaN,NaN,NaN,0,4
2,NaN,NaN,NaN,NaN,2,8
,col1,col2,col3,col4,key,vals
0,0,1,2,3,1,6
,col1,col2,col3,col4,key,vals
0,0.0,1.0,2.0,3.0,1.0,6.0
1,4.0,5.0,6.0,7.0,NaN,NaN
2,8.0,9.0,10.0,11.0,NaN,NaN
3,NaN,NaN,NaN,NaN,0.0,4.0
4,NaN,NaN,NaN,NaN,2.0,8.0
,key,vals,col1,col2,col3,col4
0,0,4,NaN,NaN,NaN,NaN
1,1,6,0.0,1.0,2.0,3.0
2,2,8,NaN,NaN,NaN,NaN

In [43]:
# Get rows which are bot in another DataFrame
df1 = pd.DataFrame(data = {'col1' : [1, 2, 3, 4, 5], 'col2' : [10, 11, 12, 13, 14]}) 
df2 = pd.DataFrame(data = {'col1' : [1, 2, 3], 'col2' : [10, 11, 12]})
df = df1[~df1.isin(df2)].dropna()
display_side_by_side(df1,df2,df)

,col1,col2
0,1,10
1,2,11
2,3,12
3,4,13
4,5,14
,col1,col2
0,1,10
1,2,11
2,3,12
,col1,col2
3,4.0,13.0
4,5.0,14.0

## Aggregating infromation in DataFrame

### Simple means, medians etc.

In [44]:
# Simple example
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[:2,1] = np.nan
display(df)

# Mean by column, change axis=0 to get rows
display(df.mean(axis = 1, skipna = False))
display(df.mean(axis = 1, skipna = True))

              ff        ee        tt       uuu
first   0.913663       NaN  0.138403  0.741817
second  0.591420       NaN  0.083292  0.429265
third   0.323967  0.049306  0.258327  0.280430
fourth  0.118102  0.686354  0.122944  0.620003

first          NaN
second         NaN
third     0.228007
fourth    0.386851
dtype: float64

first     0.597961
second    0.367992
third     0.228007
fourth    0.386851
dtype: float64

### Apply means, medians etc. to subportion of data frame

In [5]:
# Easy way to calculate aggregations using lambdas and apply
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
cols_to_apply = ['ff', 'tt', 'uuu']
df2 = pd.DataFrame(df.apply(lambda x: np.max(x[cols_to_apply]), axis = 1), columns = ['Max of column subset'])
df3 = pd.DataFrame(df.apply(lambda x: np.mean(x[cols_to_apply]), axis = 1), columns = ['Mean of column subset'])

display_side_by_side(df,df2,df3)

In [31]:
df = pd.DataFrame({'name1':['A','A','B','B'],'val1':[3.1,8,1.2,4.5],'val2':[5,9,7,3]})

rows_to_apply = df[df['val2'] < 6].index
cols_to_apply = ['val1']

display_side_by_side(df)
display(rows_to_apply)

#df2 = df.loc[rows_to_apply, cols_to_apply]

df2 = pd.DataFrame(df.apply(lambda x: np.mean(x.loc[rows_to_apply, cols_to_apply]), axis = 0))
df2

,name1,val1,val2
0,A,3.1,5
1,A,8.0,9
2,B,1.2,7
3,B,4.5,3

Int64Index([0, 3], dtype='int64')

IndexingError: ('Too many indexers', 'occurred at index name1')

### 'Group by' in various forms

In [46]:
data = {'ID': [1, 1, 2], 'Names': ['Kate', 'John', 'Max'], 'Age': [50, 25, 40], 'Values': [3, 4, 8]}
df = pd.DataFrame(data = data, index = ['first','second','first'])
df.index.name = 'Index'

result1 = df.groupby(['ID'])['Values'].sum()
result1 = pd.DataFrame(result1)

result2 = df.groupby([df.index])['Age'].mean()
result2 = pd.DataFrame(result2)

result3 = df.groupby([df.index])['Age'].count()
result3 = pd.DataFrame(result3)

display_side_by_side(df,result1,result2,result3)

#### Table of counts/means for categorical variable

In [44]:
data = {'ID': [1, 1, 1, 2, 2], 'Type': ['moo', 'boo', 'boo', np.nan, 'moo'], 'Values': [3, 4, 6, 7, 4]}
df = pd.DataFrame(data = data)

# They magic touch is reset_index: count calculation is done on this new column!
df2 = df[['ID', 'Type']].reset_index().groupby(['ID','Type'], as_index = False).count()
df2.columns = ['ID', 'Type', 'count']

# Carefull with missing values! This works with them and assign them as -1
df3 = df[['ID', 'Type']].fillna(-1).reset_index().groupby(['ID','Type'], as_index = False).count()
df3.columns = ['ID', 'Type', 'count']

df4 = df[['ID','Type','Values']].copy().groupby(['ID','Type'], as_index = False).mean()
df4.columns = ['ID', 'Type', 'mean']

display_side_by_side(df,df2,df3,df4)

,ID,Type,Values
0,1,moo,3
1,1,boo,4
2,1,boo,6
3,2,NaN,7
4,2,moo,4
,ID,Type,count
0,1,boo,2
1,1,moo,1
2,2,moo,1
,ID,Type,count
0,1,boo,2
1,1,moo,1
2,2,-1,1
3,2,moo,1
,ID,Type,mean
0,1,boo,5
1,1,moo,3
2,2,moo,4

#### Table of counts for continuous variable

In [48]:
def continuous_binning(pdseries, bins):
    '''
    Bins continious variable. Treats also NaNs
    Returns data frame.
    '''    
    df_test = pd.DataFrame()
    df_test['bins'] = pd.cut(pdseries, bins, right = True)
    df_test = df_test[['bins']].reset_index().groupby(['bins'], as_index = False).count()
    df_test.columns = ['bins','count']
    df_nans = pd.DataFrame({'bins': ['NaN'], 'count': [len(pdseries[np.isnan(pdseries)])]})
    df_test = df_test.append(df_nans, ignore_index = True)
    return df_test


df = pd.DataFrame(data = {'ID': [1, 2, 3,4, 5], 'Values': [3.5, 4, 8.7, 12.6, 7]})
df2 = pd.DataFrame(data = {'ID': [1, 2, 3,4, 5], 'Values': [3.5, 4, 8.7, 12.6, np.nan]})
bins = [0, 3, 6, 9, 12, 15, np.inf]

y = df['Values']
df3 = continuous_binning(y, bins)

y = df2['Values']
df4 = continuous_binning(y, bins)

display_side_by_side(df,df3,df4)

,ID,Values
0,1,3.5
1,2,4.0
2,3,8.7
3,4,12.6
4,5,7.0
,bins,count
0,"(0, 3]",0
1,"(3, 6]",2
2,"(6, 9]",2
3,"(9, 12]",0
4,"(12, 15]",1
5,"(15, inf]",0
6,NaN,0
,bins,count
0,"(0, 3]",0
1,"(3, 6]",2
2,"(6, 9]",1
3,"(9, 12]",0
4,"(12, 15]",1
5,"(15, inf]",0
6,NaN,1

In [49]:
# Select sum of first greatest N values within group
data = {'ID': [1, 2, 1, 2, 1], 'Values': [3, 9, 8, 7, 3]}
df = pd.DataFrame(data = data)

df2 = df.copy()
df2.sort_values(['ID','Values'], ascending = [True, False], inplace = True)
df2 = df2.groupby('ID').head(2)
df2 = pd.DataFrame(df2.groupby(['ID'])['Values'].sum().sort_values(ascending = False))

display_side_by_side(df,df2)

In [50]:
# Combination of group by and apply: caluclation between grouped columns
# Example: Total price of each product bought

df = pd.DataFrame({'Product': [1, 2, 1, 2], 'Quantity': [1, 3, 2, 2], 'Price': [10, 20, 5, 2]})
df2 = pd.DataFrame(df.groupby(['Product']).apply(lambda df, a, b: sum(df[a] * df[b]), 'Quantity', 'Price'))
df2.columns = ['Total sell price']
display_side_by_side(df,df2)

### Agg method

In [51]:
# Agg is similar to apply, but agg gives the flexibility of
# applying multiple functions at once. Agg() is handy at handling
# DataFrameGroupBy objects compared to apply()

df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"score_1":[5,10,15,10]
                   ,"score_2" :[10,15,10,25]
                   ,"score_3" : [10,20,30,40]})

# Mean and sum of "score_2" grouped by "name" and "score_1" columns using apply
print(df.groupby(["name", "score_1"])["score_2"].apply(lambda x : x.mean()))
print(df.groupby(["name", "score_1"])["score_2"].apply(lambda x : x.sum()))

# Same with agg(), and even more aggregations applied to multiple columns, all at the same go!
df2 = df.groupby(["name", "score_1"]).agg({"score_2" :[np.mean, np.sum, np.max, np.min], "score_3": [np.mean]}).copy()

# You can also pass in a lambda function to agg
df3 = df.groupby(["name", "score_1"]).agg({ "score_3": lambda x: x.mean()}).copy()

display_side_by_side(df,df2,df3)

name  score_1
Baar  10         20.0
Foo   5          10.0
      15         10.0
Name: score_2, dtype: float64
name  score_1
Baar  10         40
Foo   5          10
      15         10
Name: score_2, dtype: int64

### Pivot table

In [52]:
df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"name2":['mm','mm','mm','ee']
                   ,"score_1" :[10,15,10,25]
                   ,"score_2" : [10,20,30,40]})

# Basics
df2 = df.pivot_table(values='score_1', index='name', columns = 'name2', aggfunc = [np.mean,np.max]).copy()
df3 = df.pivot_table(values='score_1', index='name', columns = 'name2', aggfunc = [np.mean,np.min], margins = True).copy()

# Shares out of row sum
df4 = df.pivot_table(values = 'score_1', index = 'name', columns = 'name2', aggfunc = [np.sum], margins = True).copy()
df4.columns = df4.columns.get_level_values(1)
df4.drop(['All'], axis = 0 , inplace = True)
df4.fillna(0, inplace = True)
df5 = df4.copy()
for _, row in df5.iterrows():
    row[0:-1] = row[0:-1] / row[-1]

display_side_by_side(df,df2,df3)
display_side_by_side(df4, df5)

name2,ee,mm,All
name,,,
Baar,25.0,15.0,40.0
Foo,0.0,20.0,20.0
name2,ee,mm,All
name,,,
Baar,0.625,0.375,40.0
Foo,0.000,1.000,20.0

<h1>Data cleaning</h1>

## Find string from data frame column

In [53]:
data = {'ID': [1, 2, 3], 'Names': ['Kate', 'John', 'Max'], 'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data, columns = ['ID', 'Names', 'Age', 'Values', 'Country'])

df2 = df[df['Names'].str.contains("John")].copy()

display_side_by_side(df, df2)

,ID,Names,Age,Values,Country
0,1,Kate,50,3,NaN
1,2,John,25,4,NaN
2,3,Max,41,8,NaN
,ID,Names,Age,Values,Country
1,2,John,25,4,NaN

## Replace all non-numerical values with NaN

In [54]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = 'dd'
df.iloc[1,2] = '-----'
df.iloc[2,2] = '#SomeErrorVal'
df2 = df.copy()

# Count amount of non-numeric in a column
print('Column ' + 'ee' + ' has {} non-numeric'.format(len(df.loc[pd.to_numeric(df['ee'], errors='coerce').isnull(), 'ee'])))

cols = ['ff', 'ee', 'tt', 'uuu']
for col in cols:
    df2[col][df2.apply(lambda x: np.isreal(x[col]) == True , axis = 1) == False] = np.nan

display_side_by_side(df,df2)

Column ee has 1 non-numeric

C:\Program Files\Anaconda3\lib\site-packages\ipykernel\__main__.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,ff,ee,tt,uuu
first,0.917584,0.0878392,0.0882069,0.727976
second,0.272932,0.500158,-----,0.147208
third,0.606316,dd,#SomeErrorVal,0.631835
fourth,0.824111,0.405234,0.407348,0.562546
,ff,ee,tt,uuu
first,0.917584,0.0878392,0.0882069,0.727976
second,0.272932,0.500158,NaN,0.147208
third,0.606316,NaN,NaN,0.631835
fourth,0.824111,0.405234,0.407348,0.562546

## Find NaN values from DataFrame

In [55]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = np.nan
df.iloc[0,0] = np.nan

# Calculate number of NaNs in column
print('Column ' + 'ee' + ' has {} NaNs'.format(pd.isnull(df['ee']).sum()))

df2 = df[df.isnull().any(axis=1)].copy()

display_side_by_side(df, df2)

Column ee has 1 NaNs

,ff,ee,tt,uuu
first,NaN,0.203049,0.389626,0.142566
second,0.828209,0.327358,0.726604,0.035119
third,0.861065,NaN,0.953240,0.469363
fourth,0.564079,0.944134,0.918997,0.107314
,ff,ee,tt,uuu
first,NaN,0.203049,0.389626,0.142566
third,0.861065,NaN,0.953240,0.469363

## Clean NaN values

In [56]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = np.nan
df.iloc[1,3] = np.nan
df.iloc[0,0] = np.nan
df2 = df.copy()
df3 = df.copy()

# Fill NaN by mean of the column
df2['ee'].fillna(df['ee'].mean(), inplace = True)

# Fill using value from previuous row
df2['uuu'].fillna(method='bfill', inplace = True)

# Fill using value from next row
df2['ff'].fillna(method='bfill', inplace = True)

# Fill multiple columns by some scalar value
df3[['ee','uuu', 'ff']] = df3[['ee','uuu', 'ff']].fillna(0)

display_side_by_side(df,df2,df3)

,ff,ee,tt,uuu
first,NaN,0.093964,0.828949,0.446109
second,0.802137,0.675975,0.333764,NaN
third,0.158932,NaN,0.101848,0.616540
fourth,0.359729,0.584612,0.753306,0.383791
,ff,ee,tt,uuu
first,0.802137,0.093964,0.828949,0.446109
second,0.802137,0.675975,0.333764,0.616540
third,0.158932,0.451517,0.101848,0.616540
fourth,0.359729,0.584612,0.753306,0.383791
,ff,ee,tt,uuu
first,0.000000,0.093964,0.828949,0.446109
second,0.802137,0.675975,0.333764,0.000000
third,0.158932,0.000000,0.101848,0.616540
fourth,0.359729,0.584612,0.753306,0.383791

## Drop rows/columns with NaN values

In [57]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5]],
                   columns=list('ABCD'))

# Drop rows (axis = 0)/ columns (axis = 1) where all elements are NaN
df2 = df.dropna(axis = 1, how = 'all').copy()

# Drop rows (axis = 0)/ columns (axis = 1) where any element is NaN
df3 = df.dropna(axis = 1, how = 'any').copy()

# Keep rows (axis = 0)/ columns (axis = 1) which have at least thresh non-NaN values
df4 = df.dropna(axis = 1, thresh = 2).copy()

display_side_by_side(df, df2, df3, df4)

## Find nonnumeric values from string column

In [58]:
data = {'ID': [1, 2, 3], 'Names': ['Kate', 'John', 'Max'], 'Values': ['3', '4g', '8']}
df = pd.DataFrame(data=data, columns = ['ID', 'Names', 'Values'])
df2 = df[pd.to_numeric(df['Values'], errors='coerce').isnull()].copy()
display(df2)

   ID Names Values
1   2  John     4g

# Working with time and dates

## Time and date data types

Pandas use 4 types of time functionalities
<ol>
  <li>Timestamp: a point in time</li>
  <li>Period: period spanning over time range</li>
  <li>DatetimeIndex</li>
  <li>PeriodIndex</li>
</ol>

<b> It is recommended to use yyyy-mm-dd convention for dates!</b> This avoids the danger of misinterpreting months vs. days.

In [59]:
# Both of these create a TimeStamp, but only latter accepts frontward European convention!
display(pd.Timestamp('2008-12-10'))
display(pd.to_datetime('10-12-2008', dayfirst = True, format = '%d-%m-%Y')) # only to_datime has dayfirst option!

Timestamp('2008-12-10 00:00:00')

Timestamp('2008-12-10 00:00:00')

In [60]:
# Examples of periods
display(pd.Period('2013'))
display(pd.Period('2017Q1'))
display(pd.Period('05/2017'))
display(pd.Period('2017-12-10'))

Period('2013', 'A-DEC')

Period('2017Q1', 'Q-DEC')

Period('2017-05', 'M')

Period('2017-12-10', 'D')

In [61]:
# TimeStamp and Period indices in DataFrames
df1 = pd.DataFrame(np.arange(3), [pd.Timestamp('2008-12-10'), pd.Timestamp('2008-12-11'), pd.Timestamp('2008-12-12')])
df2 = pd.DataFrame(np.arange(3), [pd.Period('2008-12-10'), pd.Period('2008-12-11'), pd.Period('2008-12-12')])
df3 = pd.DataFrame(np.arange(3), [pd.Period('2008Q2'), pd.Period('2008Q3'), pd.Period('2008Q4')])
df4 = pd.DataFrame(np.arange(4), pd.date_range('2016-10-01', periods=4, freq='1D'))
df5 = pd.DataFrame(np.arange(4), pd.date_range('2016-10-01', periods=4, freq='3W-SUN')) #SUN specifies we want only sundays

display_side_by_side(df1,df2,df3,df4,df5)

,0
2008-12-10,0
2008-12-11,1
2008-12-12,2
,0
2008-12-10,0
2008-12-11,1
2008-12-12,2
,0
2008Q2,0
2008Q3,1
2008Q4,2
,0
2016-10-01,0
2016-10-02,1
2016-10-03,2
2016-10-04,3
,0
2016-10-02,0
2016-10-23,1
2016-11-13,2
2016-12-04,3

In [62]:
# Convert column into a PeriodIndex
df = pd.DataFrame({'Quarter': ['2008-01-01','2008-04-01','2008-07-01'], 'Values': [5,3,8]})
df2 = pd.DataFrame()
df2['Values'] = df['Values']
df2.index = pd.PeriodIndex(df['Quarter'], freq = '1Q')
df2.index.name = None

df3 = pd.DataFrame({'Year': ['2008', '2009', '2010'], 'Values': [5,3,8]})
df4 = pd.DataFrame()
df4['Values'] = df3['Values']
df4.index = pd.PeriodIndex(df3['Year'], freq = '1A')
df4.index.name = None

display_side_by_side(df,df2,df3,df4)

In [63]:
#TimeDelta is the difference between two TimeStamps
display(pd.Timestamp('2008-12-10') - pd.Timestamp('2009-04-10'))

Timedelta('-121 days +00:00:00')

## Harmonize dates in data frame

In [64]:

'''
Top 2 answers here: https://stackoverflow.com/questions/23581128/how-to-format-date-string-via-multiple-formats-in-python
See also http://strftime.org/
'''
import dateutil.parser
from datetime import datetime

data = {'value': [1, 2, 3, 5, 8], 'dates': ['03/25/93', '04-12-2012', 'Feb. 17, 2005', '6/2006', '2010']}
df1 = pd.DataFrame(data=data)
df2 = df1.copy()

# User-defined function for version 2
def try_parsing_date(text):
    for fmt in ('%Y-%m-%d','%m/%d/%y','%m/%d/%Y','%m-%d-%y','%m-%d-%Y',
                '%d %b %Y','%d %B %Y','%B %d, %Y','%b %d, %Y',
                '%B. %d, %Y','%b %d %Y','%b. %d, %Y','%B %d %Y',
                '%B %Y','%B, %Y','%b, %Y','%b %Y','%m/%Y','%Y'):
        try:
            return datetime.strptime(text, fmt)
        except ValueError:
            pass
    print(text)
    raise ValueError('no valid date format found')

# This is version1 relying on dateutil.parser
# It is pretty good in general case, but might fail on
# very custom dates. Further, fallback treatment for eg. 
# missing days or months is werid; it takes current day/month!
datetimes1 = list()
for index, row in df2.iterrows():
    datetimes1.append(dateutil.parser.parse(row['dates']))
df1['dates_dt'] = datetimes1

# Second version with user-defined function relies on
# datetime.strptime. It is more detailed as different date
# formats can be specified separately. Further, fallback treatment
# of missgin days/months is more convenient
datetimes2 = list()
for index, row in df2.iterrows():
    datetimes2.append(try_parsing_date(row['dates']))
df2['dates_dt'] = datetimes2    


display_side_by_side(df1,df2)

,dates,value,dates_dt
0,03/25/93,1,1993-03-25
1,04-12-2012,2,2012-04-12
2,"Feb. 17, 2005",3,2005-02-17
3,6/2006,5,2006-06-12
4,2010,8,2010-08-12
,dates,value,dates_dt
0,03/25/93,1,1993-03-25
1,04-12-2012,2,2012-04-12
2,"Feb. 17, 2005",3,2005-02-17
3,6/2006,5,2006-06-01
4,2010,8,2010-01-01

## Time series tricks

### Basic operations

In [65]:
# Start indexing from Thursday 2009-10-01
df = pd.DataFrame({'Values': np.random.randn(8).cumsum()}
                  ,index = pd.date_range('2009-10-01'
                  , periods=8, freq='1W-THU'))

# Nth differences
df2 = df.diff(2).copy()

# Downsample to monthly by mean (or sum, min, max)
df3 = df.resample('M').mean().copy()

# Upsample, and upfill
df3b = df.resample('D').ffill().copy()

# Upsample, use interpolation
df3c = df.resample('D').interpolate('linear').copy()

# Slice DataFrame to only include observations between some range
df4 = df['2009-10-09':'2009-11-07'].copy()

# Change frequency
df5 = df.asfreq('2W-THU').copy()

display_side_by_side(df,df2,df3,df3b.head(10),df3c.head(10),df4,df5)

,Values
2009-10-01,-1.122051
2009-10-08,-0.380112
2009-10-15,-1.423378
2009-10-22,0.047529
2009-10-29,0.998034
2009-11-05,0.231819
2009-11-12,1.007777
2009-11-19,-0.701414
,Values
2009-10-01,NaN
2009-10-08,NaN
2009-10-15,-0.301327
2009-10-22,0.427641
2009-10-29,2.421412
2009-11-05,0.184290
2009-11-12,0.009743
2009-11-19,-0.933233
,Values
2009-10-31,-0.375995
2009-11-30,0.179394
,Values
2009-10-01,-1.122051
2009-10-02,-1.122051
2009-10-03,-1.122051
2009-10-04,-1.122051
2009-10-05,-1.122051
2009-10-06,-1.122051
2009-10-07,-1.122051
2009-10-08,-0.380112
2009-10-09,-0.380112
2009-10-10,-0.380112
,Values
2009-10-01,-1.122051
2009-10-02,-1.016060
2009-10-03,-0.910068
2009-10-04,-0.804077
2009-10-05,-0.698086
2009-10-06,-0.592094
2009-10-07,-0.486103
2009-10-08,-0.380112
2009-10-09,-0.529150
2009-10-10,-0.678188
,Values
2009-10-15,-1.423378
2009-10-22,0.047529
2009-10-29,0.998034
2009-11-05,0.231819
,Values
2009-10-01,-1.122051
2009-10-15,-1.423378
2009-10-29,0.998034
2009-11-12,1.007777

<h3>Get mean value per day over multiple years</h3>

In [67]:
startdate = datetime.datetime(2004, 1, 1)
enddate = datetime.datetime(2008, 1, 1)
days = (enddate + datetime.timedelta(days = 1) - startdate).days
data = np.random.random(days)
dates = [startdate + datetime.timedelta(days=x) for x in range(0, days)]

ts = pd.DataFrame(data, dates, columns = ['values'])
ts.index.names = ['Day']

# Average at each day over multiple years
day_averages = ts.groupby([ts.index.month, ts.index.day]).mean()
day_averages.index.names = ['Month', 'Day']
day_averages.columns = ['avg_values']

display_side_by_side(ts.head(10), pd.DataFrame(day_averages).head(10))

# Uncategorized

## Re-index columns to start e.g from 100

In [68]:
df = pd.DataFrame({'Values': np.random.randn(8).cumsum()}
                  ,index = pd.date_range('2009-10-01'
                  , periods=8, freq='1W-THU'))
df2 = df.copy()
df2['type'] = 't1'
for col in df2.columns.values[:-1]:
    gg = df2.groupby('type')[col].apply(lambda x: x.div(x.iloc[0]).subtract(1))
    df2[col] = (1 + gg) * 100
df2.drop(['type'], axis = 1, inplace = True)

display_side_by_side(df,df2)

,Values
2009-10-01,0.290385
2009-10-08,-0.227807
2009-10-15,-0.122698
2009-10-22,-0.509068
2009-10-29,-0.007475
2009-11-05,0.876634
2009-11-12,1.391419
2009-11-19,2.821744
,Values
2009-10-01,100.000000
2009-10-08,-78.450058
2009-10-15,-42.253688
2009-10-22,-175.308105
2009-10-29,-2.574245
2009-11-05,301.886828
2009-11-12,479.163695
2009-11-19,971.725625